Revit 2027 API
FabricationPartSizeMap.IsMappedProductList Property
 Are the mapped sizes for a product listed fabrication part.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsMappedProductList { get; set; }
Public Property IsMappedProductList As Boolean
	Get
	Set
public:
property bool IsMappedProductList {
	bool get ();
	void set (bool value);
}
member IsMappedProductList : bool with get, set
Property Value
Boolean
See Also
Reference
FabricationPartSizeMap Class
Autodesk.Revit.DB.Fabrication Namespace